Расширения/ПроцедурыИФункцииОбщихМодулейКонфигурации/Catalogs/АМ_ПроцедурыИФункции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>АМ_ПроцедурыИФункции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.АМ_ОбщиеМодули</xr:Item>
				<xr:Item>Catalog.АМ_МодулиОбъектовМетаданных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМетода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АМ_ВидыМетодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспортная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеТиповая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устарела</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВКонтексте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АМ_ВидыКонтекста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязанныеПроцедурыИФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПроцедураИлиФункция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АМ_ПроцедурыИФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Категории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияМетода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АМ_КатегорииПроцедурИФункций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Расширения/ПроцедурыИФункцииОбщихМодулейКонфигурации/Catalogs/АМ_ПроцедурыИФункции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьЗакладокКоммента();
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьЗакладокКоммента()
	Если Объект.Важно = "" и  НЕ Объект.КомментарийВручную Тогда
		Элементы.ГруппаВажно.Видимость = Ложь;
	Иначе                                     
		Элементы.ГруппаВажно.Видимость = Истина;
		
	КонецЕсли;	                
	
	Если Объект.Пример = "" и  НЕ Объект.КомментарийВручную Тогда
		Элементы.ГруппаПример.Видимость = Ложь;
	Иначе	
		Элементы.ГруппаПример.Видимость = Истина;
	КонецЕсли;	
	
	Если Объект.КомментарийВручную Тогда
		Элементы.СтраницаКоммВручную.Видимость = Истина;	
		СформироватьТекстКомментарияНаСервере();
	Иначе	
		Элементы.СтраницаКоммВручную.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура КомментарийВручнуюПриИзмененииНаСервере()
	ВидимостьЗакладокКоммента();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийВручнуюПриИзменении(Элемент)
	КомментарийВручнуюПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстКомментарияНаСервере()                                   
	
		//АМ_РаботаСТекстомПроцедурИФункцийСервер.ЗаполнитьТекстКомментария(Объект.Ссылка, КомментарийВручнуюТекст);
	АМ_РаботаСТекстомПроцедурИФункцийСервер.ЗаполнитьТекстКомментария(Объект, КомментарийВручнуюТекст);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекстКомментария(Команда)
	Если Не Объект.Ссылка.Пустая() Тогда
		СформироватьТекстКомментарияНаСервере();
	Иначе
		Сообщить("Прежде чем формирвать комментрий, необоходимо записать метод.");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПараметрыОтредактированы" Тогда
		КомандаПустая = Новый КомандаКомандногоИнтерфейса;
		СформироватьТекстКомментария(КомандаПустая);
	ИначеЕсли	ИмяСобытия = "ПроцедурыФункции_ДобавлениеСпискаВКомменты" Тогда
		Если	Параметр <> "" Тогда
			Объект.ТекстКомментария = Объект.ТекстКомментария + Символы.ПС + Параметр;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоКомментариюНаСервере()
	АМ_РаботаСТекстомПроцедурИФункцийСервер.ПерезаполнитьПараметрыИзТекстаКомментария(Объект.ТекстКомментария, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПоКомментарию(Команда)
	ЗаполнитьПараметрыПоКомментариюНаСервере();
	Оповестить("ПроцедурыИФункции_ПараметрыОбновлены");
КонецПроцедуры

&НаСервере
Процедура ДобавитьТекстСпискаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТекстСписка(Команда)                                                      
	ФормаСписка = ПолучитьФорму("Справочник.АМ_ПроцедурыИФункции.Форма.ФормаВставкаСписка");
	ОткрытьФорму(ФормаСписка);
	ДобавитьТекстСпискаНаСервере();
КонецПроцедуры
